/*
 Какие нам нужны функции?
 Работающие с сервером:
 - загрузка "словаря" основных типов сигналов в глобальную* переменную
 - onchange.(тип сигнала) - загрузка соотв. списка подтипов

 Локальные:
 - enable/disable кнопки добавления, если в окне ввода буковок пусто/непусто
 - если инфа о сигнале изменилась - подсветить красным звездочку
 - преобразовать полученный ответ о списке сигналов в html-структуру


 Проектные обработчики:
 - обработчик кнопки "добавить сигнал" (добавление ряда)
 - обработчик кнопки "удалить2
 - обработчик кнопки "сохранить изменения"
 - обработчик кнопки "обновление списка сигналов"

 *) под глобальной переменной подразумевается "глобальная" в пределах текущего пространства имен
 */

/* вызывается при старте.
 должна:
 1) загрузить

 */
function Init()
{


}

